integration/mediation-tests/tests-mediator-1/src/test/resources/artifacts/ESB/mediatorconfig/property/PlaceOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:placeOrder>
            <ser:order>
                <order>
                    <price>50</price>
                    <quantity>10</quantity>
                    <symbol>IBM</symbol>
                </order>
            </ser:order>
        </ser:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>