product-scenarios/10-file-processing/10.1-simple-file-movement-between-two-systems/10.1.1-reading-a-file-from-a-specified-location-in-file-system/10.1.1.1-reading-a-file-from-FTP-location/src/test/resources/vfs/source_files/requestQuote.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soapenv:Body>
        <m0:getQuote xmlns:m0="http://services.samples">
            <m0:request>
                <m0:symbol>IBM</m0:symbol>
            </m0:request>
        </m0:getQuote>
    </soapenv:Body>
</soapenv:Envelope>
