product-scenarios/1-integrating-systems-that-communicate-in-heterogeneous-message-formats/1.1-converting-soap-to-json/1.1.2-soap-to-json-using-messagetype-property/src/test/resources/source_files/1.1.2.2/request/1_1_2_2_1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <getQuote xmlns="http://services.samples">
      <request>
         <symbol>WSO2</symbol>
      </request>
   </soapenv:Body>
</soapenv:Envelope>